{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "filters": 32, "kernel_constraint": null, "name": "conv2d_1", "use_bias": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_constraint": null, "name": "conv2d_2", "use_bias": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.25, "seed": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "units": 128, "trainable": true, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "units": 10, "trainable": true, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "bias_constraint": null}}]}